import jieba
from collections import Counter
from copy import deepcopy
from os import path
from wordcloud import WordCloud , ImageColorGenerator
import matplotlib.pyplot as plt 
from imageio import imread 

jieba.load_userdict('mydict.txt')

exclude_words = {
	"可以":0, "时间":0,"自己":0,"一个":0,"时候":0,"填空":0,"考试":0,"就是":0,"没有":0,"所以":0,"题目":0,
	"这个":0,"数学":0,"如果":0,"但是":0,"还是":0,"开始":0,"因为":0,"大家":0,"需要":0,"部分":0,"复习":0,"什么":0,
	"每天":0,"最后":0,"一定":0,"一下":0,"文章":0,"我们":0,"觉得":0,"方法":0,"很多":0,"同学":0,"然后":0,"一些":0,
	"比较":0,"不是":0,"问题":0,"其实":0,"可能":0,"非常":0,"不要":0,"之后":0,"重要":0,"一遍":0,"建议":0,
	"大概":0,"知道":0,"基础":0,"分数":0,"真的":0,"总结":0,"对于":0,"这些":0,"那么":0,"或者":0,"学习":0,
	"这样":0,"应该":0,"推荐":0,"基本":0,"不会":0,"英语":0,"老师":0,"的话":0,"感觉":0,"句子":0,"之前":0,"怎么":0,
	"考前":0,"直接":0,"要求":0,"还有":0,"小时":0,"分析":0,"发现":0,"两个":0,"主要":0,"而且":0,"所有":0,
	"考场":0,"答案":0,"难度":0,"已经":0,"个人":0,"这里":0,"每个":0,"帮助":0,"这种":0,"比如":0,"意思":0,
	"虽然":0,"出来":0,"情况":0,"选项":0,"进行":0,"一点":0,"里面":0,"来说":0,"注意":0,"10":0,"认识":0,
	"完全":0,"如何":0,"一样":0,"一次":0,"当然":0,"只有":0,"分钟":0,"掌握":0,"出现":0,"结构":0,"希望":0,
	"熟悉":0,"不过":0,"遇到":0,"现在":0,"完成":0,"训练":0,"左右":0,"以及":0,"看到":0,"容易":0,"错误":0,
	"关于":0,"考生":0,"按照":0,"起来":0,"词汇量":0,"差不多":0,"分享":0,"一直":0,"多少":0,"内容":0,"一个月":0,
	"了解":0,"其他":0,"根据":0,"题型":0,"通过":0,"提高":0,"不能":0,"以上":0,"一篇":0,"几个":0,"中国":0,"学生":0,
	"后面":0,"网上":0,"一天":0,"申请":0,"材料":0,"当时":0,"使用":0,"观点":0,"只要":0,"特别":0,"首先":0,"东西":0,
	"只是":0,"词典":0,"记住":0,"认为":0,"为了":0,"下面":0,"同时":0,"这么":0,"有些":0,"另外":0,"最好":0,"一般":0,
	"选择":0,"不同":0,"能够":0,"题库":0,"语文":0,"信息":0,"毕竟":0,"不错":0,"后来":0,"出题":0,"其中":0,"第一次":0,
	"list":0,"基本上":0,"看看":0,"阶段":0,"英文":0,"具体":0,"方面":0,"加试":0,"达到":0,"结果":0,"水平":0,"至少":0,
	"提升":0,"学校":0,"并且":0,"解析":0,"不用":0,"记得":0,"模式":0,"确实":0,"整理":0,"本书":0,"各种":0,
	"解题":0,"重点":0,"认真":0,"找到":0,"很大":0,"视频":0,"为什么":0,"除了":0,"正确":0,"以后":0,"那些":0,"原因":0,
	"他们":0,"肯定":0,"大部分":0,"甚至":0,"三个":0,"一道":0,"效果":0,"上面":0,"大量":0,"事情":0, "考察":0,"前面":0,
	"因此":0,"做到":0,"方式":0,"不好":0,"适合":0,"备考":0,"准备":0,"作文":0,"一种":0,"思维":0,"清楚":0,"核心":0,
	"一本":0,"尤其":0,"每次":0,"才能":0,"语言":0,"晚上":0,"背单词":0,"必要":0,"一句":0,"就要":0,"不够":0,"只能":0,
	"软件":0,"那种":0,"大致":0,"任何":0,"好好":0,"讲解":0,"各位":0,"喜欢":0,"足够":0,"大学":0,"关键":0,
	"平时":0,"一共":0,"我会":0,"一周":0,"那个":0,"有点":0,"不管":0,"不到":0,"经常":0,"等等":0
	}

sensitive = ['陈琦','陈圣元','微臣']

def jieba_process():

	with open('answers.txt','r',encoding='utf-8') as f:
		string = f.read()
		words = [word for word in jieba.cut(string, cut_all=False) if len(word)>1]
		washed_words = deepcopy(words)
		for word in words:
			if word in exclude_words:
				washed_words.remove(word)

		c = Counter(washed_words)
		for i in c.most_common(70):
			word,freq = i 
			print(word,freq)

		for j in sensitive:
			print(j,c[j])

	f.close()

	return ' '.join(washed_words)

text = jieba_process()

# d = path.dirname(__file__)

font_path = "E:\\font\\msyhl.ttc"
image_src = "E:\\web_crawl\\gre-logo.jpg"
image_to = "E:\\web_crawl\\gre.jpg"
#initialize wordcloud 
back_coloring = imread(image_src)

wc = WordCloud(font_path=font_path ,background_color='black',max_words=500, mask=back_coloring,
	max_font_size=100, random_state=42, width=1000, height=800, margin=2)

wc.generate(text)

plt.figure()

plt.imshow(wc, interpolation="bilinear")
plt.axis("off")
plt.show()

wc.to_file(image_to)



# image = wc.to_image()
# image.show()
